tutorials/AhmedBody/runROM/system/romDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      adjointDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
sampleDirPrefix sample;
sampleRunEndTime 500;
sampleList (5 10 15 20 25);
deltaFFD    (5);
svdType  cross;
svdTol  1e-8;
svdMaxIts 100;
svdRequestedN 5;
useMF  1;
mfStep 1e-6;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
