tutorials/AhmedBody/runROM/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers false;
    geometry
    {
        body.stl
        {
            type triSurfaceMesh;
            name body;
        }
        box
        {
            type searchableBox;
            min (-0.5 0.0 0);
            max (2.0 0.4 0.5);
            name refinedBox;
        }
        box1
        {
            type searchableBox;
            min (0.84 0.0 0);
            max (1.5 0.3 0.37);
            name refinedBox1;
        }

    }

    castellatedMeshControls
    {
        features
        (
        
        {
            file "body.eMesh";
            level 4;
        }
        
        
        
        );
        refinementSurfaces
        {
            body
            {
                level ( 4 4 );
            }
            
        }

        refinementRegions
        {
            refinedBox
            {
                mode inside;
                levels ((3 3));
            }
            refinedBox1
            {
                mode inside;
                levels ((4 4));
            }
            
        }

        locationInMesh ( -0.5 0.5 0.5 );
        maxLocalCells 100000;
        maxGlobalCells 2000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 10;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            "body.*"
            {nSurfaceLayers 1;}
        }

        relativeSizes true;
        expansionRatio 1.2;
        finalLayerThickness 0.6;
        minThickness 0.001;
        nGrow 0;
        featureAngle 270;
        slipFeatureAngle 60;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 60;
        maxBoundarySkewness 4;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality 1e-16;
        minArea 1.0E-7;
        minTwist 0.05;
        minDeterminant 0.02;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
